{
	"projects": [
		{
			"name": "Bajinga!",
			"tools": ["Python", "Flask", "Flask SQLAlchemy", "Bootstrap", "CSS3", "HTML5"],
			"description": ["Prosta aplikacja webowa zbudowana w pythonie na podstawie biblioteki flask, inspirowana redditem oraz 4chanem.", "To relatywnie prosta aplikacja webowa, którą stworzyłem w czasie studiów. Została napisana w pythonie z pomocą bibliotek flask, flask-login oraz flask-sqlalchemy. W celu stylizacji użyłem Bootstrapa wraz z niewielką ilością własnego CSS. To był pierwszy raz kiedy pracowałem nad aplikacją używającej architektury MVP oraz aktualnego routingu, jak też pierwszy raz kiedy znalazłem zastosowanie dla funkcji rekursywnych. Projekt nie jest kontynuowany, choć działa dostatecznie dobrze by spełnić rolę 'proof of concept'."],
			"link": "https://github.com/IgneaVentus/python"
		},
		{
			"name": "Silith",
			"tools": ["JavaScript", "Mithril.js", "NPM", "WebPack", "CSS", "HTML5"],
			"description": ["Bardzo prosta strona statyczna zbudowana na zasadzie one-page z użyciem API map google oraz pliku konfiguracyjnego na podstawie Mithril.js", "To pierwszy raz gdy pracowałem z frameworkiem Mithril.js oraz pierwszy mój projekt używający tak dużej ilości JavaScript. Podczas jego tworzenia nauczyłem się całkiem sporo na temat możliwości, jakie oferuje modularna budowa strony połączona z skryptami. Było to też moje pierwsze zderzenie z użyciem API - w tym wypadku API map google. Choć ostateczny efekt pozostawił wiele do życzenia, to spełniał swoją funkcję jako generator prostej statycznej strony biznesowej. W retrospeksji lepiej byłoby do tego użyć WordPressa, aczkolwiek wciąż jestem zadowolony patrząc na fakt, że był to projekt studencki."],
			"link": "https://github.com/IgneaVentus/Silith"
		},
		{
			"name": "Overseer Lite",
			"tools": ["NPM", "JavaScript", "Discord.js"],
			"description": ["Prosty, prywatny bot zbudowany jako pomoc do gier RPG.", "Generalnie lubię ze znajomymi brać udział w sesjach RP, lecz w związku z tym jak chaotyczne bywa codzienne życie często mamy problem się skupić przez co gry bywają rozciągnięte i mozolne do poziomu, w którym jedyne co oferują to frustracja. Ten bot, powstały po części jako rozwiązanie tego problemu a po części jako wyzwanie dla samego siebie, miał temu zaradzić. Działa poprzez obserwację określonego przez użytkownika kanału i gdy napisze Mistrz Gry, bot uruchamia dwa minutniki. Jeden dla graczy, jeden dla samego mistrza. Gdy czas dla graczy upłynie, bot sprawdza kto odpisał i pinguje pozostałych. W wypadku drugiego minutnika, gdy czas zleci zwyczajnie pinguje mistrza gry. W bocie można ustawić długości minutników, kanał do pingowania oraz kanał do obserwacji, a na listę graczy należy samemu się wpisać aby uniknąć sytuacji gdzie ktoś będzie pingowany wbrew jego woli. Bot nie jest gotowy do szerszego użycia."],
			"link": "https://github.com/IgneaVentus/Overseer-Lite"
		},
		{
			"name": "Strona portfolio",
			"tools": ["JavaScript", "PHP", "CSS3", "HTML5"],
			"description": ["Strona na której się obecnie znajdujesz. Potrzebowałem miejsca aby móc się pokazać potencjalnym pracodawcą i stwierdziłem, że napisanie tej strony od zera będzie dobrym pomysłem.", "Strona ta jest postawiona na backendzie z PHP, używając JavaScriptu jako frontendu. Jest zbudowana modularnie - nawigacja, stopka oraz główna część strony są ładowane oddzielnie - oraz może działać zarówno z włączonym jak i wyłączonym JavaScriptem w przeglądarce. Gdy Javascript jest wyłączony, wszystkie funkcje wykonuje jedynie backend. Gdy jest włączony, JavaScript nadpisuje przyciski i przejmuje działanie strony sprawiając, że strona jest ładowana dynamicznie (AJAX). Prócz tego strona jest budowana w idealogii mobile first oraz ma wbudowany tryb nocny (wykrywany przez przeglądarkę)"],
			"link": "#"
		}
	]
}